
import { Settings } from "./types";

export const ACADEMIC_YEARS = Array.from({ length: 11 }, (_, i) => (2560 + i).toString());

export const DORMITORIES = [
  "แพรวา", "ภูไท", "ฟ้าแดด", "ลำปาว", "โปงลาง", "ภูพาน", 
  "สงยาง", "ไดโนเสาร์", "ไดโนเสาร์ 2", "มะหาด", "พะยอม", "เรือนพยาบาล"
];

export const POSITIONS = [
  "งานสารบัญ",
  "พนักงานราชการ", "ครูผู้ช่วย", "ครู", "ครูชำนาญการ", 
  "ครูชำนาญการพิเศษ", "รองผู้อำนวยการชำนาญการ", "รองผู้อำนวยการชำนาญการพิเศษ"
];

export const STUDENT_CLASSES = [
  "ประถมศึกษาปีที่ 1", "ประถมศึกษาปีที่ 2", "ประถมศึกษาปีที่ 3", "ประถมศึกษาปีที่ 4", "ประถมศึกษาปีที่ 5", "ประถมศึกษาปีที่ 6",
  "มัธยมศึกษาปีที่ 1", "มัธยมศึกษาปีที่ 2", "มัธยมศึกษาปีที่ 3", "มัธยมศึกษาปีที่ 4", "มัธยมศึกษาปีที่ 5", "มัธยมศึกษาปีที่ 6"
];

export const STUDENT_CLASSROOMS = Array.from({ length: 8 }, (_, i) => (i + 1).toString());

export const LEARNING_AREAS = [
  "ภาษาไทย",
  "คณิตศาสตร์",
  "วิทยาศาสตร์และเทคโนโลยี",
  "สังคมศึกษา ศาสนา และวัฒนธรรม",
  "สุขศึกษาและพลศึกษา",
  "ศิลปะ",
  "การงานอาชีพ",
  "ภาษาต่างประเทศ",
  "กิจกรรมพัฒนาผู้เรียน"
];

// Updated URL based on user request
export const GOOGLE_SCRIPT_URL = 'https://script.google.com/macros/s/AKfycbzPULly51wnfwG5MgS2VItYEt9Olp1RXBUmdSk8yvsgMViMr5u4iTNVZ6BlNcAheen9CA/exec';

export const DEFAULT_SETTINGS: Settings = {
    schoolName: 'โรงเรียนกาฬสินธุ์ปัญญานุกูล',
    schoolLogo: 'https://img5.pic.in.th/file/secure-sv1/-15bb7f54b4639a903.png', // Default URL
    themeColors: {
        primary: '#3B82F6',
        primaryHover: '#2563EB',
    },
    dormitories: DORMITORIES,
    positions: POSITIONS,
    academicYears: ACADEMIC_YEARS,
    studentClasses: STUDENT_CLASSES,
    studentClassrooms: STUDENT_CLASSROOMS,
    googleScriptUrl: GOOGLE_SCRIPT_URL,
    adminPassword: 'ksp'
};

export const THAI_PROVINCES = [
    "กระบี่", "กรุงเทพมหานคร", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท",
    "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่", "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม",
    "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
    "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์",
    "แพร่", "ภูเก็ต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง",
    "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ",
    "สมุทรสงคราม", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย",
    "หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี"
].sort();
